/*
数据结构概述
            数据结构 = 个体 +个体关系
            算法: 对存储数据的操作

        衡量算法的标准：
            1.时间复杂度
            2.空间复杂度
            3.难易程度
            4.健壮性

预备知识
模块一：线性结构
        连续存储【数据】
        离散存储【链表】
        线性结构两种常见应用一  栈
        线性结构两种常见应用二  队列

        专题：递归
                1. 1+2+3.。。。+100 的和
                2.求阶乘
                3.汉诺塔
                4.走迷宫
模块二：非线性和结构
        树，图
模块三: 查找和排序
        折半查找
        排序：
            冒泡
            插入
            选择
            快速排序
            归并排序
*/

